'''Ваше друге завдання полягає в обчисленні значення інтеграла функції методом Монте-Карло.

 📖 Можете обрати функцію на власний розсуд. Виконаємо побудову графіка.'''
import matplotlib.pyplot as plt
import numpy as np

# Визначення функції та межі інтегрування
def f(x):
    return x ** 2

a = 0  # Нижня межа
b = 2  # Верхня межа

# Створення діапазону значень для x
x = np.linspace(-0.5, 2.5, 400)
y = f(x)

# Створення графіка
fig, ax = plt.subplots()

# Малювання функції
ax.plot(x, y, 'r', linewidth=2)

# Заповнення області під кривою
ix = np.linspace(a, b)
iy = f(ix)
ax.fill_between(ix, iy, color='gray', alpha=0.3)

# Налаштування графіка
ax.set_xlim([x[0], x[-1]])
ax.set_ylim([0, max(y) + 0.1])
ax.set_xlabel('x')
ax.set_ylabel('f(x)')

# Додавання меж інтегрування та назви графіка
ax.axvline(x=a, color='gray', linestyle='--')
ax.axvline(x=b, color='gray', linestyle='--')
ax.set_title('Графік інтегрування f(x) = x^2 від ' + str(a) + ' до ' + str(b))
plt.grid()
plt.show()
'''1. Обчисліть значення інтеграла функції за допомогою методу Монте-Карло, інакше кажучи, знайдіть площу
під цим графіком (сіра зона).

2. Перевірте правильність розрахунків, щоб підтвердити точність методу Монте-Карло, шляхом порівняння
отриманого результату та аналітичних розрахунків або результату виконання функції quad. Зробіть висновки.

📖 Для перевірки обчислення визначеного інтеграла в Python ви можете використовувати бібліотеку SciPy,
зокрема її функцію quad з підмодуля integrate. Спочатку необхідно визначити функцію, яку ви хочете інтегрувати,
а потім використати quad для обчислення інтеграла на заданому інтервалі.'''
import scipy.integrate as spi

# Обчислення інтеграла
result, error = spi.quad(f, a, b)

print("Інтеграл: ", result, error)

############################################# My Homework beneath ###################################################
import random

def monte_carlo(a, b, experiment):
    '''проводить експерименти в заданій кількості спроб'''
    y_max = f(b)
    average_area = 0

    for _ in range(experiment):
        ins_point = 0

        for _ in range(10_000):
            if random.uniform(0, y_max) <= f(random.uniform(a, b)):
                ins_point += 1

        average_area += (ins_point/10_000) * ((b-a) * y_max)

    average_area /= experiment
    return average_area

print('Monte Carlo: ', monte_carlo(a, b, 1000))
