'''Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік". Для виробництва цих напоїв
використовуються різні інгредієнти та обмежена кількість обладнання. Задача полягає у максимізації
виробництва, враховуючи обмежені ресурси.

Умови завдання:
1. "Лимонад" виготовляється з "Води", "Цукру" та "Лимонного соку".
2. "Фруктовий сік" виготовляється з "Фруктового пюре" та "Води".
3. Обмеження ресурсів: 100 од. "Води", 50 од. "Цукру", 30 од. "Лимонного соку" та 40 од. "Фруктового пюре".
4. Виробництво одиниці "Лимонаду" вимагає 2 од. "Води", 1 од. "Цукру" та 1 од. "Лимонного соку".
5. Виробництво одиниці "Фруктового соку" вимагає 2 од. "Фруктового пюре" та 1 од. "Води".

Використовуючи PuLP, створіть модель, яка визначає, скільки "Лимонаду" та "Фруктового соку" потрібно
виробити для максимізації загальної кількості продуктів, дотримуючись обмежень на ресурси. Напишіть
програму, код якої максимізує загальну кількість вироблених продуктів "Лимонад" та "Фруктовий сік",
враховуючи обмеження на кількість ресурсів.'''

import pulp

model = pulp.LpProblem('Maximize count', pulp.LpMaximize)
# основні товари
lemonade = pulp.LpVariable('Lemonade', lowBound=0, cat='Integer')
fruit_juice = pulp.LpVariable('Fruit_juice', lowBound=0, cat='Integer')

# ресурси з яких виготовляється
water = 100
sugar = 50
fruit_pure = 40
lemon_juice = 30
# що ми максимізуємо
model += lemonade + fruit_juice, 'Count'
# обмежуємо ресурсами
model += 2*lemonade + 1*fruit_juice <= water
model += 1*lemonade <= sugar
model += 1*lemonade <= lemon_juice
model += 2*fruit_juice <= fruit_pure

model.solve()

print('Виробляти лимонадів: ', lemonade.varValue)
print('Виробляти фруктових пюре: ', fruit_juice.varValue)
